# HostObjectSubcomponentInfo Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HostObjectSubcomponentInfo Members
HostObjectSubcomponentInfo Class Methods Properties See Also
---
The HostObjectSubcomponentInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the HostObjectSubcomponentInfo |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetCurveLoop | Gets the CurveLoop representing the base profile curve loop of the roof or floor slab |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetPlane | Gets the plane representing the normal and origin of the surface containg the base profile curve loop of the roof or floor slab. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AreaOfCurveLoop | The area of the CurveLoop of the roof or floor slab. |
| Depth | The depth of the roof or floor slab. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LoopFace | The face of the loops of the roof or floor slab. |

# See Also
HostObjectSubcomponentInfo Class
Autodesk.Revit.DB.IFC Namespace